---
type: ForgeTypeId
namespace: Autodesk.Revit.DB
version: 2024
members: 11
tags: [revit-api, class]
---

# ForgeTypeId

`Autodesk.Revit.DB.ForgeTypeId` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ForgeTypeId | — | `` |
| Constructor | ForgeTypeId | 2021 | `public ForgeTypeId ()` |
| Method | Clear | 2021 | `public ForgeTypeId Clear ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | Empty | 2021 | `public bool Empty ()` |
| Method | Equals | 2021 | `public override bool Equals ( Object other )` |
| Method | GetHashCode | 2021 | `public override int GetHashCode ()` |
| Method | NameEquals | 2021 | `public bool NameEquals ( ForgeTypeId other )` |
| Method | StrictlyEquals | 2021 | `public bool StrictlyEquals ( ForgeTypeId other )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | TypeId | 2021 | `public string TypeId { get ; set ; }` |